Tekla Open API Reference for Tekla Structures 2025
Rotation3D Methods
The Rotation3D type exposes the following members.
Methods
Name | Description
Equals
Compares with another rotation.
FromZRotation
Creates Rotation3D which represents rotation around the Z axis.
Top
See Also
Reference
Rotation3D Class
Tekla.Structures.Model.Geometry Namespace